{
  "video_url": "https://youtube.com/watch?v=egGAWaRwJgo",
  "title": "MONKEY MAJIK - Bitten By You (feat. Spookiz The Movie)",
  "duration": 252,
  "safety_score": 90,
  "category_scores": {
    "Violence": 18,
    "Language": 14,
    "Scary Content": 10,
    "Sexual Content": 15,
    "Substance Use": 10,
    "Dangerous Behavior": 10,
    "Educational Value": 3
  },
  "summary": "This video features cartoonish monsters and a spooky, vampire-themed narrative with dark and eerie visuals that might be unsettling for very young or sensitive children. It contains no explicit violence, profanity, sexual content, or substance use, and has low educational value.",
  "risk_factors": [
    "Frame 2: The image is very dark and somewhat blurry, making it difficult to discern fine details. It appears to be a still from an animation, featuring a character that seems to have a green head/face and possibly orange hair or an accessory. The overall environment is dark and indistinct, with a faint light source in the background.\n\nGiven the darkness and lack of clear detail, there is nothing explicitly visible in this image that depicts violence, weapons, nudity, explicit content, drug/alcohol use, or overtly dangerous situations. While the dark setting might be perceived as slightly mysterious or subtly eerie by some very young or sensitive children, it does not appear to be overtly scary, disturbing, or to contain jump scares or grotesque imagery. The character itself, from what little is visible, does not appear to be designed to be frightening.\n\nTherefore, based on the visible content of this specific image:\n\nSAFE_FOR_KIDS",
    "Frame 6: The image features a large, dark, silhouetted character with a somewhat menacing, yet cartoonish, appearance. Its eyes are visible as small, faint dots, and it has shapes on its head that resemble hammers or mallets, along with a top ornament that looks like a four-leaf clover or cross. The overall lighting is very dark and misty, creating an eerie or spooky atmosphere.\n\nGiven the title of the video, 'MONKEY MAJIK - Bitten By You (feat. Spookiz The Movie)', the character likely originates from the \"Spookiz\" franchise, which is known for its animated monster characters aimed at children. While the dark setting and the monster-like appearance of the character might be slightly unsettling or mildly scary for very young or sensitive children, it does not depict any explicit violence, weapons being used in an aggressive manner (the hammers appear to be part of the character's design), nudity, explicit content, drug/alcohol use, dangerous situations, or truly disturbing visual effects. The imagery aligns with the common \"friendly monster\" or \"mildly spooky\" themes found in children's media, particularly around Halloween.\n\nTherefore, while it has a spooky aesthetic, it appears to be within the typical range of content for a children's animated feature.\n\nSAFE_FOR_KIDS",
    "Frame 7: The image is extremely dark and indistinct, making it very difficult to discern any specific details. While there appear to be some faint, blurry shapes in shades of red and green, and two small, light-colored vertical lines that could vaguely suggest features in a shadowy environment, no explicit content (violence, weapons, nudity, explicit content, drug/alcohol use, dangerous situations, scary imagery, jump scares, or disturbing visual effects) is clearly visible. The overall impression is one of darkness and ambiguity rather than any specific offensive or inappropriate content.\n\nSAFE_FOR_KIDS",
    "Frame 9: The image displays a scene with a dark, blue-toned background, suggesting a nighttime or dim environment. A character with a pale, skull-like or stylized white mask and red clothing is visible, seemingly riding on or interacting with a large, dark, indistinct creature or object.\n\n**Potentially problematic elements for young children:**\n\n*   **Scary Imagery:** The character's mask, which resembles a skull or a blank, unsettling face with dark eye sockets, could be frightening or disturbing for very young children. The large, dark, and somewhat amorphous creature also contributes to an eerie or potentially scary atmosphere. The overall dark lighting adds to the mysterious and potentially unsettling mood.\n\nWhile there is no explicit violence, nudity, drug/alcohol use, or immediate dangerous situations depicted, the \"scary imagery\" of the masked character and the dark, mysterious setting could be inappropriate or unsettling for sensitive young children.",
    "Frame 10: The image is very dark, with a dominant palette of deep blues and blacks, suggesting a nighttime or shadowy environment. In the center, a stylized character is visible, appearing to have a pale, almost mask-like or skull-like face, characteristic of the character Cula from the 'Spookiz' series (a child-friendly vampire). This character also shows some lighter, possibly yellowish or orange, coloration on its body. The character appears to be perched on or interacting with a large, dark, indistinct form, which could be another monster or part of the scenery, giving a sense of movement.\n\nPotential concerns for young children:\n*   **Scary imagery:** While the \"Spookiz\" franchise is generally aimed at children and features child-friendly monsters, the very dark lighting and the stylized appearance of the characters (specifically the pale, somewhat skull-like face and the large, shadowy creature) could be perceived as mildly scary or unsettling by very young or particularly sensitive children. The overall aesthetic leans into a \"spooky\" theme common in children's monster content.\n\nThere are no apparent elements of violence, weapons, nudity, explicit content, drug/alcohol use, dangerous realistic situations, jump scares (as it's a still image), or overtly disturbing visual effects beyond the general spooky theme."
  ],
  "keywords": [
    "Spooky",
    "Vampire",
    "Animation",
    "Monsters",
    "Dark atmosphere"
  ],
  "recommendation": "Safe",
  "audio_transcript": " Come on, we're gonna go Well, you see no upper-faction No need for reflection I'm happy that I got it back You know you look so delicious That you're superstitious Only they need to lean me back You know I like the taste of you The way you shake, shake, shake That life in you Come on, come on, let's go live Minus control Oh baby, baby, don't make me beg for more Go ahead I've been bitten by you Not only are we only one to step forward But we go ahead Go ahead, I'm here I've been bitten by you Y...",
  "analysis_timestamp": "2025-06-14T12:54:07.734030"
}