{
  "video_url": "https://youtube.com/watch?v=egGAWaRwJgo",
  "title": "MONKEY MAJIK - Bitten By You (feat. Spookiz The Movie)",
  "duration": 252,
  "safety_score": 82,
  "category_scores": {
    "Violence": 20,
    "Language": 15,
    "Scary Content": 12,
    "Sexual Content": 15,
    "Substance Use": 10,
    "Dangerous Behavior": 10,
    "Educational Value": 0
  },
  "summary": "This music video features cartoon monster characters and a vampire theme. While generally designed for children, some dark, spooky visuals and monster designs may be unsettling for very young or sensitive viewers, but there is no violence, inappropriate language, or other concerning content.",
  "risk_factors": [
    "Frame 4: The image is extremely dark and blurry, making it very difficult to discern specific details. It appears to show a dark, misty environment, possibly indoors or at night, with some indistinct shapes in the background that could be figures or objects. On the far left, there is a faint suggestion of a brick wall.\n\nBased on the extreme lack of clarity in the image, there is no discernible content that depicts:\n*   Violence or weapons\n*   Nudity or explicit content\n*   Drug or alcohol use\n*   Dangerous situations\n*   Jump scares or disturbing visual effects (beyond the general blurriness itself)\n\nWhile the dark and hazy atmosphere could be interpreted as slightly mysterious or even a tiny bit unsettling due to the obscurity for some very sensitive young children, there are no explicit \"scary imagery\" elements like monsters, ghosts, or threatening figures clearly visible. The vagueness of the image prevents any specific problematic content from being identified.\n\nTherefore, based solely on the provided image, it appears to be:\nSAFE_FOR_KIDS",
    "Frame 6: The image is very dark and shows a silhouette of a character from the 'Spookiz' animated series, most likely Cula, who resembles a Frankenstein-like monster with bolts on the sides of his head and a cross-like shape on top. The dark, somewhat foggy or misty background creates an eerie or mysterious atmosphere.\n\nHowever, based on the nature of the 'Spookiz' franchise, which features friendly monster characters aimed at a young audience, this imagery is likely intended to be more playfully spooky than genuinely frightening. There is no depiction of violence, weapons, nudity, explicit content, drug/alcohol use, or overtly dangerous situations. While the darkness might be slightly unsettling for very sensitive children, the character design and the context of the source material suggest it falls within the realm of acceptable \"monster fun\" for kids.\n\nTherefore, this image is considered:\n\nSAFE_FOR_KIDS",
    "Frame 9: The image shows a dark, animated scene featuring a character with a white, skull-like or monster-like mask and dark eye sockets. This character appears to be riding on a large, dark, amorphous creature or object against a dark blue background, possibly indicating a nighttime or foggy setting.\n\nThe potential concerns for young children include:\n\n*   **Scary Imagery:** The masked character has a somewhat unsettling, monster-like appearance, which could be frightening or disturbing for very young or sensitive children. The dark setting and the large, shadowy creature further contribute to a potentially spooky or eerie atmosphere. While it's from an animated film likely intended for children (given \"Spookiz\"), the \"spooky\" aesthetic might not be suitable for all young viewers.\n\nThere are no overt signs of violence, weapons, nudity, explicit content, drug/alcohol use, or dangerous real-world situations depicted. However, the imagery is designed to be \"spooky,\" which can be a form of \"scary imagery.\"\n\nTherefore, it is not \"SAFE_FOR_KIDS\" for all young children, especially those easily scared by monster-like characters or dark themes.",
    "Frame 10: The image displays a dark, dimly lit scene featuring a character with a prominent white, mask-like or skeletal face. The character appears to be a monster-like figure, consistent with the \"Spookiz\" franchise which features animated spooky characters.\n\nWhile the \"Spookiz\" characters are generally designed for children and are often portrayed as friendly, this particular still image, due to the dark lighting and the character's somewhat ghoulish or skull-like appearance, could be perceived as scary or unsettling for very young or sensitive children. The white, hollow-eyed face against a dark background can evoke a sense of unease.\n\nTherefore, while not containing violence, explicit content, or dangerous situations, the image does contain **scary imagery** that might be inappropriate for young children due to its potentially frightening appearance.",
    "Frame 11: The image depicts a cartoon character from 'Spookiz The Movie' with wide, startled eyes and an open mouth, appearing scared or surprised. The scene is dimly lit with a predominant purple hue, which creates a dark and somewhat eerie atmosphere. While the character is cartoonish and there is no explicit violence, weapons, nudity, explicit content, drug/alcohol use, or overtly dangerous situations, the combination of the character's fearful expression and the dim, moody lighting could be mildly unsettling or scary for very young or highly sensitive children, particularly as it suggests a moment of fright or suspense."
  ],
  "keywords": [
    "Spookiz",
    "Vampire",
    "Cartoon",
    "Monsters",
    "Music video"
  ],
  "recommendation": "Safe",
  "audio_transcript": " Come on, we're gonna go Well, you see no upper-faction No need for reflection I'm happy that I got it back You know you look so delicious That you're superstitious Only they need to lean me back You know I like the taste of you The way you shake, shake, shake That life in you Come on, come on, let's go live Minus control Oh baby, baby, don't make me beg for more Go ahead I've been bitten by you Not only are we only one to step forward But we go ahead Go ahead, I'm here I've been bitten by you Y...",
  "analysis_timestamp": "2025-06-14T13:30:17.430060"
}